---
type: TilePattern
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# TilePattern

`Autodesk.Revit.DB.TilePattern` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Parameter | — | `` |
| Property | TilePatternType | — | `public TilePatternsBuiltIn TilePatternType { get ; }` |
| Property | TilesPerSeedNode | — | `public int TilesPerSeedNode { get ; }` |